<?php

namespace Database\Seeders;

use App\Models\Intellect;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class IntellectAnswerSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $rawData = [
            [
                'question' => 'Я часто ищу значения слов в словарях.',
                'question_kz' => 'Сөздердің мағынасын сөздіктерден жиі іздеймін.',
                'intellect' => 'Лингвистический',
            ],
            [
                'question' => 'Мне нравится учить новые слова и языки.',
                'question_kz' => 'Маған жаңа сөздер мен тілдерді үйрену ұнайды.',
                'intellect' => 'Лингвистический',
            ],
            [
                'question' => 'Мне нравятся языки и общественные науки.',
                'question_kz' => 'Маған тілдер мен әлеуметтік ғылымдар ұнайды.',
                'intellect' => 'Лингвистический',
            ],
            [
                'question' => 'Мне нравится читать.',
                'question_kz' => 'Мен оқығанды ұнатамын.',
                'intellect' => 'Лингвистический',
            ],
            [
                'question' => 'Я пишу стихи, цитаты, истории или веду дневник.',
                'question_kz' => 'Мен өлеңдер, дәйексөздер, әңгімелер жазамын немесе күнделік жүргіземін.',
                'intellect' => 'Лингвистический',
            ],
            [
                'question' => 'Я умею работать с цифрами.',
                'question_kz' => 'Мен сандармен жұмыс істей аламын.',
                'intellect' => 'Логико-Математический',
            ],
            [
                'question' => 'У меня всегда были отличные оценки по математике и точным наукам.',
                'question_kz' => 'Математика мен жаратылыстану пәндерінен әрқашан жақсы баға алдым.',
                'intellect' => 'Логико-Математический',
            ],
            [
                'question' => 'Мне нравятся игры и задачи, требующие латерального мышления, например шахматы.',
                'question_kz' => 'Маған шахмат сияқты бүйірлік ойлауды қажет ететін ойындар мен қиындықтар ұнайды.',
                'intellect' => 'Логико-Математический',
            ],
            [
                'question' => 'Мне нравится что-то измерять или сортировать.',
                'question_kz' => 'Маған заттарды өлшеу немесе сұрыптау ұнайды.',
                'intellect' => 'Логико-Математический',
            ],
            [
                'question' => 'Я люблю собирать кубика Рубика и разгадывать судоку.',
                'question_kz' => 'Мен Рубик кубиктерін және судоку жұмбақтарын шешкенді ұнатамын.',
                'intellect' => 'Логико-Математический',
            ],
            [
                'question' => 'Я люблю танцы, спорт и тренировки.',
                'question_kz' => 'Мен билегенді, спортты және жаттығуды жақсы көремін.',
                'intellect' => 'Телесно-Кинестетический',
            ],
            [
                'question' => 'Я не против испачкать руки, создавая, строя или ремонтируя что-то.',
                'question_kz' => 'Мен бірдеңе жасағанда, салғанда немесе жөндегенде, қолымды кірлеуге қарсы емеспін.',
                'intellect' => 'Телесно-Кинестетический',
            ],
            [
                'question' => 'Мне нравится шитьё, резьба, изготовление моделей или иные виды деятельности, предусматривающие мелкую моторику.',
                'question_kz' => 'Маған тігін, ою, модель жасау немесе ұсақ моториканы қамтитын басқа да әрекеттер ұнайды.',
                'intellect' => 'Телесно-Кинестетический',
            ],
            [
                'question' => 'Мне легче найти решение проблемы, когда я нахожусь в движении.',
                'question_kz' => 'Маған қозғалыста болған кезде мәселенің шешімін табу оңайырақ.',
                'intellect' => 'Телесно-Кинестетический',
            ],
            [
                'question' => 'Мне нравятся разные виды спорта.',
                'question_kz' => 'Мен әртүрлі спорт түрлерін ұнатамын.',
                'intellect' => 'Телесно-Кинестетический',
            ],
            [
                'question' => 'Я хорошо распознаю ложь.',
                'question_kz' => 'Мен өтірікті жақсы анықтаймын',
                'intellect' => 'Межличностный',
            ],
            [
                'question' => 'Я много думаю об эмоциях других людей.',
                'question_kz' => 'Мен басқа адамдардың эмоциялары туралы көп ойлаймын.',
                'intellect' => 'Межличностный',
            ],
            [
                'question' => 'У меня хорошо получается сглаживать конфликты между другими людьми.',
                'question_kz' => 'Мен басқа адамдар арасындағы қақтығыстарды жақсы шешемін.',
                'intellect' => 'Межличностный',
            ],
            [
                'question' => 'При знакомстве с новыми людьми я умею производить хорошее впечатление.',
                'question_kz' => 'Жаңа адамдармен танысқанда мен жақсы әсер қалдыруды білемін.',
                'intellect' => 'Межличностный',
            ],
            [
                'question' => 'Другие люди часто приходят ко мне за поддержкой или советом.',
                'question_kz' => 'Басқа адамдар маған қолдау немесе кеңес алу үшін жиі келеді.',
                'intellect' => 'Межличностный',
            ],
            [
                'question' => 'Я хорошо лажу с животными.',
                'question_kz' => 'Мен жануарлармен жақсы араласамын.',
                'intellect' => 'Натуралистический',
            ],
            [
                'question' => 'Мне нравится ухаживать за садами и растениями.',
                'question_kz' => 'Мен бақшалар мен өсімдіктерге күтім жасауды ұнатамын.',
                'intellect' => 'Натуралистический',
            ],
            [
                'question' => 'Я чувствую себя наиболее живым(-ой) в контакте с природой.',
                'question_kz' => 'Табиғатпен араласқанда өзімді ең тірі сезінемін.',
                'intellect' => 'Натуралистический',
            ],
            [
                'question' => 'Я люблю долгие прогулки на природе в одиночестве или с друзьями.',
                'question_kz' => 'Жаңа адамдармен танысқанда мен жақсы әсер қалдыруды білемін.',
                'intellect' => 'Натуралистический',
            ],
            [
                'question' => 'Мне нравится изучать различные виды растений и животных.',
                'question_kz' => 'Мен өсімдіктер мен жануарлардың әртүрлі түрлерін зерттеуді ұнатамын.',
                'intellect' => 'Натуралистический',
            ],
        ];

        foreach ($rawData as $item) {
            $data[] = [
                'question' => $item['question'],
                'question_kz' => $item['question_kz'],
                'intellect_id' => Intellect::query()->where('name', $item['intellect'])->first()->id,
                'created_at' => now(),
                'updated_at' => now()
            ];
        }

        DB::table('answers')
            ->insert($data);
    }
}
