<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class IntellectSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $rawData = [
            [
                'name' => 'Лингвистический',
                'name_kz' => 'Лингвистикалық',
                'description' => 'Способность эффективно использовать слова, как устно, так и письменно. Люди с таким интеллектом преуспевают в чтении, письме и общении.',
                'description_kz' => 'Сөздерді тиімді пайдалану қабілеті, ауызша немесе жазбаша түрде. Мұндай интеллектке ие адамдар оқуда, жазуда және қарым-қатынаста шебер.'
            ],
            [
                'name' => 'Логико-Математический',
                'name_kz' => 'Логикалық-Математикалық',
                'description' => 'Способность рассуждать, вычислять и мыслить логически. Люди с таким интеллектом любят решать головоломки, работать с числами и анализировать проблемы.',
                'description_kz' => 'Логикалық ойлау, есептеу және талдау қабілеті. Мұндай интеллектке ие адамдар жұмбақтарды шешкенді, сандармен жұмыс істегенді және мәселелерді талдағанды ұнатады.'
            ],
            [
                'name' => 'Телесно-Кинестетический',
                'name_kz' => 'Дене-Кинестетикалық',
                'description' => 'Способность контролировать движения тела и умело обращаться с предметами. Такие люди часто становятся спортсменами, танцорами или ремесленниками.',
                'description_kz' => 'Дене қозғалыстарын бақылау және заттарды шебер пайдалану қабілеті. Мұндай адамдар спортшылар, бишілер немесе қолөнершілер болып табылады.'
            ],
            [
                'name' => 'Межличностный',
                'name_kz' => 'Аралық Қарым-Қатынас',
                'description' => 'Способность понимать и эффективно взаимодействовать с другими людьми. Такие люди хорошо владеют коммуникацией, эмпатией и работой в команде.',
                'description_kz' => 'Басқаларды түсіну және тиімді қарым-қатынас жасау қабілеті. Мұндай адамдар қарым-қатынас, эмпатия және топпен жұмыс жасауда шебер.'
            ],
            [
                'name' => 'Натуралистический',
                'name_kz' => 'Табиғатқа Жақын',
                'description' => 'Способность распознавать и классифицировать природные элементы, такие как растения, животные и экосистемы. Такие люди часто являются любителями природы или экологами.',
                'description_kz' => 'Өсімдіктер, жануарлар және экожүйелер сияқты табиғи элементтерді тану және жіктеу қабілеті. Мұндай адамдар табиғат сүйер қауым немесе экологтар болып табылады.'
            ],
        ];

        foreach ($rawData as $item) {
            $data[] = [
                'name' => $item['name'],
                'name_kz' => $item['name_kz'],
                'description' => $item['description'],
                'description_kz' => $item['description_kz'],
                'created_at' => now(),
                'updated_at' => now()
            ];
        }

        DB::table('intellects')
            ->insert($data);
    }
}
