<?php

namespace Database\Seeders;

use App\Models\Profession;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ProfessionRatingSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $rawData = [
            [
                'name' => 'Инженер-электрик',
                'rating' => 92,
                'man' => 95,
                'woman' => 80,
            ],
            [
                'name' => 'Инженер-механик',
                'rating' => 90,
                'man' => 100,
                'woman' => 75,
            ],[
                'name' => 'Инженер-строитель',
                'rating' => 92,
                'man' => 98,
                'woman' => 80,
            ],[
                'name' => 'Инженер-химик',
                'rating' => 97,
                'man' => 85,
                'woman' => 80,
            ],[
                'name' => 'Инженер по автоматизации',
                'rating' => 99,
                'man' => 95,
                'woman' => 76,
            ],[
                'name' => 'Робототехник',
                'rating' => 100,
                'man' => 99,
                'woman' => 76,
            ],[
                'name' => 'Инженер-технолог',
                'rating' => 90,
                'man' => 93,
                'woman' => 80,
            ],[
                'name' => 'Аэрокосмический инженер',
                'rating' => 88,
                'man' => 100,
                'woman' => 82,
            ],[
                'name' => 'Инженер-энергетик',
                'rating' => 92,
                'man' => 98,
                'woman' => 80,
            ],[
                'name' => 'Инженер-конструктор',
                'rating' => 96,
                'man' => 99,
                'woman' => 80,
            ],[
                'name' => 'Материаловед',
                'rating' => 84,
                'man' => 90,
                'woman' => 80,
            ],[
                'name' => 'Нанотехнолог',
                'rating' => 92,
                'man' => 85,
                'woman' => 80,
            ],[
                'name' => 'Машиностроитель',
                'rating' => 90,
                'man' => 100,
                'woman' => 75,
            ],[
                'name' => 'Телекоммуникационный инженер',
                'rating' => 92,
                'man' => 85,
                'woman' => 80,
            ],[
                'name' => 'Финансовый аналитик',
                'rating' => 100,
                'man' => 90,
                'woman' => 85,
            ],[
                'name' => 'Экономист',
                'rating' => 97,
                'man' => 88,
                'woman' => 87,
            ],[
                'name' => 'Бухгалтер',
                'rating' => 80,
                'man' => 81,
                'woman' => 95,
            ],[
                'name' => 'Аудитор',
                'rating' => 96,
                'man' => 85,
                'woman' => 90,
            ],[
                'name' => 'Банкир',
                'rating' => 91,
                'man' => 93,
                'woman' => 80,
            ],[
                'name' => 'Инвестиционный менеджер',
                'rating' => 98,
                'man' => 95,
                'woman' => 83,
            ],[
                'name' => 'Риск-менеджер',
                'rating' => 93,
                'man' => 93,
                'woman' => 85,
            ],[
                'name' => 'Менеджер по продажам',
                'rating' => 100,
                'man' => 92,
                'woman' => 83,
            ],[
                'name' => 'Управляющий проектами (Project Manager)',
                'rating' => 99,
                'man' => 90,
                'woman' => 87,
            ],[
                'name' => 'Консультант по бизнес-стратегии',
                'rating' => 99,
                'man' => 93,
                'woman' => 85,
            ],[
                'name' => 'Специалист по налогам',
                'rating' => 95,
                'man' => 85,
                'woman' => 90,
            ],[
                'name' => 'Руководитель компании (CEO)',
                'rating' => 99,
                'man' => 98,
                'woman' => 80,
            ],[
                'name' => 'Предприниматель',
                'rating' => 99,
                'man' => 95,
                'woman' => 83,
            ],[
                'name' => 'Аналитик данных (Data Analyst) в бизнесе',
                'rating' => 100,
                'man' => 90,
                'woman' => 87,
            ],[
                'name' => 'Специалист по финансовому планированию',
                'rating' => 100,
                'man' => 87,
                'woman' => 90,
            ],[
                'name' => 'Туроператор',
                'rating' => 82,
                'man' => 85,
                'woman' => 90,
            ],[
                'name' => 'Турагент',
                'rating' => 80,
                'man' => 80,
                'woman' => 93,
            ],[
                'name' => 'Экскурсовод',
                'rating' => 80,
                'man' => 87,
                'woman' => 90,
            ],[
                'name' => 'Гид-переводчик',
                'rating' => 83,
                'man' => 85,
                'woman' => 92,
            ],[
                'name' => 'Организатор мероприятий (Event Manager)',
                'rating' => 90,
                'man' => 84,
                'woman' => 93,
            ],[
                'name' => 'Руководитель туристических групп',
                'rating' => 82,
                'man' => 90,
                'woman' => 85,
            ],[
                'name' => 'Администратор гостиницы',
                'rating' => 90,
                'man' => 81,
                'woman' => 95,
            ],[
                'name' => 'Менеджер по бронированию',
                'rating' => 80,
                'man' => 78,
                'woman' => 93,
            ],[
                'name' => 'Специалист по работе с VIP-клиентами',
                'rating' => 90,
                'man' => 85,
                'woman' => 90,
            ],[
                'name' => 'Управляющий гостиницей',
                'rating' => 90,
                'man' => 90,
                'woman' => 87,
            ],[
                'name' => 'Специалист по авиабилетам',
                'rating' => 80,
                'man' => 83,
                'woman' => 90,
            ],[
                'name' => 'Разработчик туристических маршрутов',
                'rating' => 82,
                'man' => 87,
                'woman' => 88,
            ],[
                'name' => 'Специалист по экотуризму',
                'rating' => 85,
                'man' => 90,
                'woman' => 85,
            ],[
                'name' => 'Инструктор по активным видам туризма',
                'rating' => 89,
                'man' => 95,
                'woman' => 79,
            ],[
                'name' => 'Культуролог (в сфере туризма)',
                'rating' => 80,
                'man' => 82,
                'woman' => 90,
            ],[
                'name' => 'Юрист',
                'rating' => 100,
                'man' => 90,
                'woman' => 90,
            ],[
                'name' => 'Адвокат',
                'rating' => 98,
                'man' => 93,
                'woman' => 87,
            ],[
                'name' => 'Нотариус',
                'rating' => 85,
                'man' => 85,
                'woman' => 93,
            ],[
                'name' => 'Судья',
                'rating' => 98,
                'man' => 91,
                'woman' => 89,
            ],[
                'name' => 'Прокурор',
                'rating' => 93,
                'man' => 93,
                'woman' => 85,
            ],[
                'name' => 'Следователь',
                'rating' => 93,
                'man' => 95,
                'woman' => 83,
            ],[
                'name' => 'Эксперт-криминалист',
                'rating' => 95,
                'man' => 92,
                'woman' => 85,
            ],[
                'name' => 'Специалист по трудовому праву',
                'rating' => 90,
                'man' => 86,
                'woman' => 93,
            ],[
                'name' => 'Специалист по международному праву',
                'rating' => 95,
                'man' => 90,
                'woman' => 90,
            ],[
                'name' => 'Специалист по интеллектуальной собственности',
                'rating' => 92,
                'man' => 87,
                'woman' => 91,
            ],[
                'name' => 'Медиационный юрист',
                'rating' => 95,
                'man' => 86,
                'woman' => 93,
            ],[
                'name' => 'Консультант по корпоративному праву',
                'rating' => 92,
                'man' => 90,
                'woman' => 89,
            ],[
                'name' => 'Специалист по уголовному праву',
                'rating' => 99,
                'man' => 93,
                'woman' => 85,
            ],[
                'name' => 'Врач-терапевт',
                'rating' => 98,
                'man' => 89,
                'woman' => 93,
            ],[
                'name' => 'Хирург',
                'rating' => 96,
                'man' => 98,
                'woman' => 83,
            ],[
                'name' => 'Стоматолог',
                'rating' => 98,
                'man' => 91,
                'woman' => 89,
            ],[
                'name' => 'Педиатр',
                'rating' => 98,
                'man' => 84,
                'woman' => 100,
            ],[
                'name' => 'Кардиолог',
                'rating' => 99,
                'man' => 93,
                'woman' => 87,
            ],[
                'name' => 'Невролог',
                'rating' => 92,
                'man' => 89,
                'woman' => 91,
            ],[
                'name' => 'Офтальмолог',
                'rating' => 94,
                'man' => 87,
                'woman' => 93,
            ],[
                'name' => 'Ортопед',
                'rating' => 92,
                'man' => 95,
                'woman' => 85,
            ],[
                'name' => 'Психиатр',
                'rating' => 98,
                'man' => 90,
                'woman' => 90,
            ],[
                'name' => 'Медсестра/медбрат',
                'rating' => 95,
                'man' => 76,
                'woman' => 98,
            ],[
                'name' => 'Лаборант-аналитик',
                'rating' => 90,
                'man' => 86,
                'woman' => 93,
            ],[
                'name' => 'Фармацевт',
                'rating' => 91,
                'man' => 83,
                'woman' => 99,
            ],[
                'name' => 'Диетолог',
                'rating' => 90,
                'man' => 81,
                'woman' => 98,
            ],[
                'name' => 'Физиотерапевт',
                'rating' => 90,
                'man' => 89,
                'woman' => 91,
            ],[
                'name' => 'Ветеринар',
                'rating' => 90,
                'man' => 87,
                'woman' => 91,
            ],[
                'name' => 'Гинеколог',
                'rating' => 95,
                'man' => 93,
                'woman' => 87,
            ],[
                'name' => 'Дерматолог',
                'rating' => 92,
                'man' => 87,
                'woman' => 93,
            ],[
                'name' => 'Социолог',
                'rating' => 91,
                'man' => 85,
                'woman' => 91,
            ],[
                'name' => 'Политолог',
                'rating' => 90,
                'man' => 89,
                'woman' => 87,
            ],[
                'name' => 'Антрополог',
                'rating' => 82,
                'man' => 87,
                'woman' => 89,
            ],[
                'name' => 'Психолог',
                'rating' => 98,
                'man' => 88,
                'woman' => 100,
            ],[
                'name' => 'Историк',
                'rating' => 90,
                'man' => 91,
                'woman' => 87,
            ],[
                'name' => 'Культуролог',
                'rating' => 82,
                'man' => 85,
                'woman' => 91,
            ],[
                'name' => 'Географ',
                'rating' => 83,
                'man' => 89,
                'woman' => 89,
            ],[
                'name' => 'Демограф',
                'rating' => 91,
                'man' => 87,
                'woman' => 91,
            ],[
                'name' => 'Этнограф',
                'rating' => 80,
                'man' => 85,
                'woman' => 91,
            ],[
                'name' => 'Эколог',
                'rating' => 85,
                'man' => 89,
                'woman' => 91,
            ],[
                'name' => 'Исследователь общественного мнения',
                'rating' => 91,
                'man' => 87,
                'woman' => 91,
            ],[
                'name' => 'Урбанист',
                'rating' => 92,
                'man' => 91,
                'woman' => 87,
            ],[
                'name' => 'Международные отношения',
                'rating' => 92,
                'man' => 89,
                'woman' => 91,
            ],[
                'name' => 'Агроном',
                'rating' => 87,
                'man' => 91,
                'woman' => 89,
            ],[
                'name' => 'Зоотехник',
                'rating' => 80,
                'man' => 93,
                'woman' => 87,
            ],[
                'name' => 'Ветеринар',
                'rating' => 90,
                'man' => 91,
                'woman' => 91,
            ],[
                'name' => 'Фермер',
                'rating' => 86,
                'man' => 95,
                'woman' => 83,
            ],[
                'name' => 'Селекционер',
                'rating' => 87,
                'man' => 89,
                'woman' => 91,
            ],[
                'name' => 'Биотехнолог в сельском хозяйстве',
                'rating' => 92,
                'man' => 89,
                'woman' => 91,
            ],[
                'name' => 'Агроинженер',
                'rating' => 88,
                'man' => 93,
                'woman' => 85,
            ],[
                'name' => 'Специалист по ирригации',
                'rating' => 91,
                'man' => 93,
                'woman' => 85,
            ],[
                'name' => 'Специалист по защите растений',
                'rating' => 82,
                'man' => 89,
                'woman' => 89,
            ],[
                'name' => 'Техник-агроном',
                'rating' => 84,
                'man' => 91,
                'woman' => 87,
            ],[
                'name' => 'Рыбовод',
                'rating' => 77,
                'man' => 93,
                'woman' => 78,
            ],[
                'name' => 'Специалист по переработке сельскохозяйственной продукции',
                'rating' => 90,
                'man' => 89,
                'woman' => 89,
            ],[
                'name' => 'Пчеловод',
                'rating' => 77,
                'man' => 91,
                'woman' => 87,
            ],[
                'name' => 'Инспектор по качеству сельскохозяйственной продукции',
                'rating' => 90,
                'man' => 97,
                'woman' => 91,
            ],[
                'name' => 'Дизайнер одежды',
                'rating' => 89,
                'man' => 89,
                'woman' => 93,
            ],[
                'name' => 'Стилист',
                'rating' => 90,
                'man' => 86,
                'woman' => 95,
            ],[
                'name' => 'Технолог швейного производства',
                'rating' => 78,
                'man' => 87,
                'woman' => 91,
            ],[
                'name' => 'Визажист',
                'rating' => 82,
                'man' => 81,
                'woman' => 97,
            ],[
                'name' => 'Парикмахер',
                'rating' => 79,
                'man' => 85,
                'woman' => 93,
            ],[
                'name' => 'Косметолог',
                'rating' => 85,
                'man' => 77,
                'woman' => 97,
            ],[
                'name' => 'Фэшн-иллюстратор',
                'rating' => 80,
                'man' => 87,
                'woman' => 91,
            ],[
                'name' => 'Художник по костюмам (в кино, театре)',
                'rating' => 85,
                'man' => 87,
                'woman' => 93,
            ],[
                'name' => 'Модель',
                'rating' => 90,
                'man' => 83,
                'woman' => 98,
            ],[
                'name' => 'Специалист по текстилю',
                'rating' => 83,
                'man' => 87,
                'woman' => 89,
            ],[
                'name' => 'Менеджер модного бренда',
                'rating' => 88,
                'man' => 89,
                'woman' => 91,
            ],[
                'name' => 'Фэшн-аналитик',
                'rating' => 88,
                'man' => 87,
                'woman' => 89,
            ],[
                'name' => 'Директор модных показов',
                'rating' => 85,
                'man' => 89,
                'woman' => 91,
            ],[
                'name' => 'Ювелир',
                'rating' => 85,
                'man' => 91,
                'woman' => 89,
            ],[
                'name' => 'Учитель (школьный)',
                'rating' => 100,
                'man' => 89,
                'woman' => 93,
            ],[
                'name' => 'Преподаватель вуза',
                'rating' => 95,
                'man' => 91,
                'woman' => 91,
            ],[
                'name' => 'Методист',
                'rating' => 96,
                'man' => 86,
                'woman' => 93,
            ],[
                'name' => 'Воспитатель детского сада',
                'rating' => 90,
                'man' => 79,
                'woman' => 98,
            ],[
                'name' => 'Логопед',
                'rating' => 100,
                'man' => 84,
                'woman' => 100,
            ],[
                'name' => 'Коуч по личностному развитию',
                'rating' => 99,
                'man' => 89,
                'woman' => 91,
            ],[
                'name' => 'Руководитель образовательных программ',
                'rating' => 99,
                'man' => 91,
                'woman' => 91,
            ],[
                'name' => 'Администратор образовательного учреждения',
                'rating' => 95,
                'man' => 87,
                'woman' => 91,
            ],[
                'name' => 'Исследователь в области педагогики',
                'rating' => 95,
                'man' => 89,
                'woman' => 91,
            ],[
                'name' => 'Специалист по дошкольному образованию',
                'rating' => 98,
                'man' => 84,
                'woman' => 98,
            ],[
                'name' => 'Карьерный консультант',
                'rating' => 98,
                'man' => 87,
                'woman' => 93,
            ],[
                'name' => 'Профориентолог',
                'rating' => 98,
                'man' => 87,
                'woman' => 93,
            ],[
                'name' => 'Педагог-психолог',
                'rating' => 97,
                'man' => 86,
                'woman' => 100,
            ],[
                'name' => 'Программист (Frontend, Backend, Fullstack)',
                'rating' => 100,
                'man' => 96,
                'woman' => 87,
            ],[
                'name' => 'Разработчик мобильных приложений',
                'rating' => 100,
                'man' => 93,
                'woman' => 87,
            ],[
                'name' => 'Специалист по кибербезопасности',
                'rating' => 100,
                'man' => 98,
                'woman' => 83,
            ],[
                'name' => 'Аналитик данных (Data Analyst)',
                'rating' => 100,
                'man' => 91,
                'woman' => 91,
            ],[
                'name' => 'Инженер данных (Data Engineer)',
                'rating' => 100,
                'man' => 93,
                'woman' => 87,
            ],[
                'name' => 'Разработчик игр (Game Developer)',
                'rating' => 100,
                'man' => 95,
                'woman' => 85,
            ],[
                'name' => 'Тестировщик ПО (QA-инженер)',
                'rating' => 100,
                'man' => 89,
                'woman' => 91,
            ],[
                'name' => 'Архитектор программного обеспечения',
                'rating' => 100,
                'man' => 96,
                'woman' => 87,
            ],[
                'name' => 'Инженер по машинному обучению (ML Engineer)',
                'rating' => 100,
                'man' => 96,
                'woman' => 87,
            ],[
                'name' => 'UX/UI дизайнер',
                'rating' => 100,
                'man' => 87,
                'woman' => 96,
            ],[
                'name' => 'Веб-разработчик',
                'rating' => 100,
                'man' => 93,
                'woman' => 89,
            ],[
                'name' => 'Специалист по искусственному интеллекту (AI Specialist)',
                'rating' => 100,
                'man' => 96,
                'woman' => 87,
            ],[
                'name' => 'Продуктовый менеджер (Product Manager)',
                'rating' => 95,
                'man' => 91,
                'woman' => 91,
            ],[
                'name' => 'IT-консультант',
                'rating' => 100,
                'man' => 91,
                'woman' => 89,
            ],[
                'name' => 'Специалист по автоматизации процессов (RPA Developer)',
                'rating' => 95,
                'man' => 93,
                'woman' => 87,
            ],[
                'name' => 'Инженер-нефтяник',
                'rating' => 95,
                'man' => 98,
                'woman' => 83,
            ],[
                'name' => 'Геофизик',
                'rating' => 88,
                'man' => 95,
                'woman' => 85,
            ],[
                'name' => 'Инженер по разработке месторождений',
                'rating' => 95,
                'man' => 98,
                'woman' => 83,
            ],[
                'name' => 'Специалист по бурению скважин',
                'rating' => 82,
                'man' => 100,
                'woman' => 75,
            ],[
                'name' => 'Специалист по альтернативной энергетике',
                'rating' => 91,
                'man' => 91,
                'woman' => 91,
            ],[
                'name' => 'Оператор нефтяных и газовых установок',
                'rating' => 95,
                'man' => 98,
                'woman' => 76,
            ],[
                'name' => 'Механик по обслуживанию горного оборудования',
                'rating' => 81,
                'man' => 98,
                'woman' => 81,
            ],[
                'name' => 'Машинист буровых установок',
                'rating' => 80,
                'man' => 100,
                'woman' => 75,
            ],[
                'name' => 'Шахтёр',
                'rating' => 76,
                'man' => 100,
                'woman' => 75,
            ],[
                'name' => 'Специалист по переработке нефти и газа',
                'rating' => 93,
                'man' => 95,
                'woman' => 85,
            ],[
                'name' => 'Эколог (в энергетике и добыче)',
                'rating' => 88,
                'man' => 89,
                'woman' => 93,
            ],[
                'name' => 'Специалист по автоматизации энергетических систем',
                'rating' => 96,
                'man' => 95,
                'woman' => 87,
            ],[
                'name' => 'Руководитель шахты или месторождения',
                'rating' => 89,
                'man' => 98,
                'woman' => 76,
            ],[
                'name' => 'Инженер-гидротехник',
                'rating' => 91,
                'man' => 93,
                'woman' => 87,
            ],[
                'name' => 'Учёный-исследователь',
                'rating' => 92,
                'man' => 94,
                'woman' => 93,
            ],[
                'name' => 'Физик',
                'rating' => 90,
                'man' => 95,
                'woman' => 87,
            ],[
                'name' => 'Химик',
                'rating' => 90,
                'man' => 91,
                'woman' => 91,
            ],[
                'name' => 'Биолог',
                'rating' => 90,
                'man' => 89,
                'woman' => 95,
            ],[
                'name' => 'Астроном',
                'rating' => 85,
                'man' => 95,
                'woman' => 85,
            ],[
                'name' => 'Математик',
                'rating' => 92,
                'man' => 99,
                'woman' => 89,
            ],[
                'name' => 'Геолог',
                'rating' => 90,
                'man' => 93,
                'woman' => 85,
            ],[
                'name' => 'Эколог',
                'rating' => 90,
                'man' => 89,
                'woman' => 95,
            ],[
                'name' => 'Нанотехнолог',
                'rating' => 91,
                'man' => 93,
                'woman' => 89,
            ],[
                'name' => 'Биоинженер',
                'rating' => 91,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Генетик',
                'rating' => 91,
                'man' => 89,
                'woman' => 98,
            ],[
                'name' => 'Специалист по квантовым технологиям',
                'rating' => 91,
                'man' => 98,
                'woman' => 87,
            ],[
                'name' => 'Лаборант в научных исследованиях',
                'rating' => 88,
                'man' => 89,
                'woman' => 93,
            ],[
                'name' => 'Художник',
                'rating' => 89,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Дизайнер',
                'rating' => 100,
                'man' => 89,
                'woman' => 100,
            ],[
                'name' => 'Актёр',
                'rating' => 88,
                'man' => 93,
                'woman' => 91,
            ],[
                'name' => 'Режиссёр',
                'rating' => 90,
                'man' => 95,
                'woman' => 87,
            ],[
                'name' => 'Музыкант',
                'rating' => 85,
                'man' => 93,
                'woman' => 91,
            ],[
                'name' => 'Певец',
                'rating' => 85,
                'man' => 89,
                'woman' => 95,
            ],[
                'name' => 'Хореограф',
                'rating' => 90,
                'man' => 87,
                'woman' => 98,
            ],[
                'name' => 'Арт-директор',
                'rating' => 90,
                'man' => 93,
                'woman' => 89,
            ],[
                'name' => 'Фотограф',
                'rating' => 87,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Продюсер',
                'rating' => 92,
                'man' => 96,
                'woman' => 89,
            ],[
                'name' => 'Декоратор',
                'rating' => 92,
                'man' => 87,
                'woman' => 96,
            ],[
                'name' => 'Радиоведущий',
                'rating' => 89,
                'man' => 91,
                'woman' => 91,
            ],[
                'name' => 'Телеведущий',
                'rating' => 90,
                'man' => 91,
                'woman' => 91,
            ],[
                'name' => 'Композитор',
                'rating' => 85,
                'man' => 95,
                'woman' => 87,
            ],[
                'name' => 'Архитектор',
                'rating' => 100,
                'man' => 94,
                'woman' => 91,
            ],[
                'name' => 'Градостроитель',
                'rating' => 96,
                'man' => 93,
                'woman' => 89,
            ],[
                'name' => 'Проектировщик конструкций',
                'rating' => 97,
                'man' => 95,
                'woman' => 87,
            ],[
                'name' => 'Дизайнер интерьеров',
                'rating' => 95,
                'man' => 87,
                'woman' => 98,
            ],[
                'name' => 'Ландшафтный архитектор',
                'rating' => 99,
                'man' => 89,
                'woman' => 96,
            ],[
                'name' => 'Инженер по водоснабжению и канализации',
                'rating' => 85,
                'man' => 95,
                'woman' => 85,
            ],[
                'name' => 'Инженер по отоплению и вентиляции (HVAC)',
                'rating' => 95,
                'man' => 95,
                'woman' => 85,
            ],[
                'name' => 'Инженер-геодезист',
                'rating' => 95,
                'man' => 98,
                'woman' => 83,
            ],[
                'name' => 'Сметчик',
                'rating' => 90,
                'man' => 91,
                'woman' => 91,
            ],[
                'name' => 'Технадзор (контроль строительства)',
                'rating' => 90,
                'man' => 98,
                'woman' => 83,
            ],[
                'name' => 'Инженер по строительным материалам',
                'rating' => 96,
                'man' => 93,
                'woman' => 87,
            ],[
                'name' => 'Прораб',
                'rating' => 95,
                'man' => 100,
                'woman' => 75,
            ],[
                'name' => 'Инженер по противопожарным системам',
                'rating' => 89,
                'man' => 95,
                'woman' => 85,
            ],[
                'name' => 'Маркетолог',
                'rating' => 99,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Бренд-менеджер',
                'rating' => 92,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Копирайтер',
                'rating' => 85,
                'man' => 87,
                'woman' => 97,
            ],[
                'name' => 'SMM-специалист',
                'rating' => 90,
                'man' => 87,
                'woman' => 98,
            ],[
                'name' => 'Контент-менеджер',
                'rating' => 95,
                'man' => 87,
                'woman' => 98,
            ],[
                'name' => 'SEO-специалист',
                'rating' => 95,
                'man' => 93,
                'woman' => 89,
            ],[
                'name' => 'Специалист по таргетированной рекламе',
                'rating' => 93,
                'man' => 89,
                'woman' => 96,
            ],[
                'name' => 'Дизайнер рекламы',
                'rating' => 95,
                'man' => 89,
                'woman' => 96,
            ],[
                'name' => 'Маркетинговый аналитик',
                'rating' => 100,
                'man' => 93,
                'woman' => 89,
            ],[
                'name' => 'Специалист по PR',
                'rating' => 90,
                'man' => 89,
                'woman' => 95,
            ],[
                'name' => 'Event-менеджер (в маркетинге)',
                'rating' => 97,
                'man' => 89,
                'woman' => 98,
            ],[
                'name' => 'Исследователь рынка',
                'rating' => 99,
                'man' => 94,
                'woman' => 91,
            ],[
                'name' => 'Менеджер по продукту',
                'rating' => 95,
                'man' => 97,
                'woman' => 89,
            ],[
                'name' => 'CRM-менеджер',
                'rating' => 90,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'PR-директор',
                'rating' => 97,
                'man' => 97,
                'woman' => 89,
            ],[
                'name' => 'Тренер по спорту',
                'rating' => 85,
                'man' => 98,
                'woman' => 87,
            ],[
                'name' => 'Спортивный врач',
                'rating' => 90,
                'man' => 97,
                'woman' => 91,
            ],[
                'name' => 'Физиотерапевт',
                'rating' => 92,
                'man' => 94,
                'woman' => 93,
            ],[
                'name' => 'Спортсмен',
                'rating' => 90,
                'man' => 100,
                'woman' => 89,
            ],[
                'name' => 'Судья спортивных соревнований',
                'rating' => 81,
                'man' => 95,
                'woman' => 87,
            ],[
                'name' => 'Менеджер спортивных мероприятий',
                'rating' => 87,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Инструктор по фитнесу',
                'rating' => 85,
                'man' => 91,
                'woman' => 95,
            ],[
                'name' => 'Комментатор спортивных событий',
                'rating' => 85,
                'man' => 95,
                'woman' => 87,
            ],[
                'name' => 'Инструктор по йоге',
                'rating' => 85,
                'man' => 87,
                'woman' => 97,
            ],[
                'name' => 'Инструктор по плаванию',
                'rating' => 85,
                'man' => 94,
                'woman' => 93,
            ],[
                'name' => 'Реабилитолог (в спорте)',
                'rating' => 91,
                'man' => 91,
                'woman' => 95,
            ],[
                'name' => 'Спортивный агент',
                'rating' => 82,
                'man' => 95,
                'woman' => 87,
            ],[
                'name' => 'Преподаватель физической культуры',
                'rating' => 80,
                'man' => 98,
                'woman' => 89,
            ],[
                'name' => 'Спортивный журналист',
                'rating' => 90,
                'man' => 91,
                'woman' => 91,
            ],[
                'name' => 'Массажист (в спортивной сфере)',
                'rating' => 80,
                'man' => 89,
                'woman' => 95,
            ],[
                'name' => 'Эксперт по спортивным тренажёрам',
                'rating' => 82,
                'man' => 93,
                'woman' => 89,
            ],[
                'name' => 'Депутат',
                'rating' => 95,
                'man' => 98,
                'woman' => 85,
            ],[
                'name' => 'Государственный служащий',
                'rating' => 90,
                'man' => 93,
                'woman' => 91,
            ],[
                'name' => 'Советник по государственным вопросам',
                'rating' => 90,
                'man' => 96,
                'woman' => 89,
            ],[
                'name' => 'Дипломат',
                'rating' => 92,
                'man' => 96,
                'woman' => 89,
            ],[
                'name' => 'Специалист по международным отношениям',
                'rating' => 92,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Эксперт по правам человека',
                'rating' => 89,
                'man' => 89,
                'woman' => 95,
            ],[
                'name' => 'Менеджер социальных проектов',
                'rating' => 90,
                'man' => 89,
                'woman' => 95,
            ],[
                'name' => 'Руководитель государственных программ',
                'rating' => 95,
                'man' => 97,
                'woman' => 89,
            ],[
                'name' => 'Пресс-секретарь государственного органа',
                'rating' => 90,
                'man' => 89,
                'woman' => 95,
            ],[
                'name' => 'Лоббист',
                'rating' => 90,
                'man' => 93,
                'woman' => 87,
            ],[
                'name' => 'Исследователь в области политологии',
                'rating' => 85,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Специалист по взаимодействию с гражданами',
                'rating' => 88,
                'man' => 89,
                'woman' => 95,
            ],[
                'name' => 'Журналист в сфере политики',
                'rating' => 95,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Сотрудник посольства',
                'rating' => 92,
                'man' => 93,
                'woman' => 91,
            ],[
                'name' => 'Логист',
                'rating' => 94,
                'man' => 94,
                'woman' => 91,
            ],[
                'name' => 'Менеджер по транспортной логистике',
                'rating' => 94,
                'man' => 96,
                'woman' => 89,
            ],[
                'name' => 'Менеджер по закупкам',
                'rating' => 90,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Импорт-менеджер',
                'rating' => 90,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Диспетчер транспортной компании',
                'rating' => 93,
                'man' => 93,
                'woman' => 89,
            ],[
                'name' => 'Аналитик логистических процессов',
                'rating' => 91,
                'man' => 91,
                'woman' => 91,
            ],[
                'name' => 'Менеджер по управлению цепочками поставок',
                'rating' => 95,
                'man' => 96,
                'woman' => 89,
            ],[
                'name' => 'Специалист по таможенному оформлению',
                'rating' => 81,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Менеджер по управлению запасами',
                'rating' => 85,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Руководитель склада',
                'rating' => 95,
                'man' => 98,
                'woman' => 85,
            ],[
                'name' => 'Кладовщик',
                'rating' => 88,
                'man' => 98,
                'woman' => 83,
            ],[
                'name' => 'Транспортный экспедитор',
                'rating' => 96,
                'man' => 95,
                'woman' => 87,
            ],[
                'name' => 'Менеджер по международной логистике',
                'rating' => 92,
                'man' => 93,
                'woman' => 91,
            ],[
                'name' => 'Специалист по оптимизации логистических процессов',
                'rating' => 91,
                'man' => 93,
                'woman' => 91,
            ],[
                'name' => 'Менеджер по организации грузоперевозок',
                'rating' => 91,
                'man' => 95,
                'woman' => 87,
            ],[
                'name' => 'Повар',
                'rating' => 80,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Кондитер',
                'rating' => 84,
                'man' => 87,
                'woman' => 97,
            ],[
                'name' => 'Швея',
                'rating' => 76,
                'man' => 79,
                'woman' => 100,
            ],[
                'name' => 'Массажист',
                'rating' => 78,
                'man' => 89,
                'woman' => 95,
            ],[
                'name' => 'Авто-механик',
                'rating' => 89,
                'man' => 100,
                'woman' => 75,
            ],[
                'name' => 'Автослесарь',
                'rating' => 81,
                'man' => 100,
                'woman' => 75,
            ],[
                'name' => 'Мастер шиномонтажа',
                'rating' => 75,
                'man' => 100,
                'woman' => 75,
            ],[
                'name' => 'Электрик',
                'rating' => 90,
                'man' => 100,
                'woman' => 76,
            ],[
                'name' => 'Сантехник',
                'rating' => 75,
                'man' => 100,
                'woman' => 75,
            ],[
                'name' => 'Водитель такси',
                'rating' => 75,
                'man' => 98,
                'woman' => 76,
            ],[
                'name' => 'Специалист по ремонту бытовой техники',
                'rating' => 75,
                'man' => 98,
                'woman' => 75,
            ],[
                'name' => 'Продавец',
                'rating' => 75,
                'man' => 89,
                'woman' => 95,
            ],[
                'name' => 'Автомеханик',
                'rating' => 90,
                'man' => 100,
                'woman' => 75,
            ],[
                'name' => 'Авто-электрик',
                'rating' => 90,
                'man' => 100,
                'woman' => 75,
            ],[
                'name' => 'Инженер по двигателям',
                'rating' => 82,
                'man' => 98,
                'woman' => 85,
            ],[
                'name' => 'Инженер по тестированию автомобилей',
                'rating' => 95,
                'man' => 95,
                'woman' => 87,
            ],[
                'name' => 'Технолог автомобильного производства',
                'rating' => 89,
                'man' => 95,
                'woman' => 87,
            ],[
                'name' => 'Мастер цеха',
                'rating' => 79,
                'man' => 98,
                'woman' => 83,
            ],[
                'name' => 'Контролер качества автомобилей',
                'rating' => 95,
                'man' => 93,
                'woman' => 89,
            ],[
                'name' => 'Специалист по ремонту гибридных и электромобилей',
                'rating' => 95,
                'man' => 98,
                'woman' => 85,
            ],[
                'name' => 'Менеджер по продажам автомобилей',
                'rating' => 90,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Менеджер автопарка',
                'rating' => 95,
                'man' => 93,
                'woman' => 89,
            ],[
                'name' => 'Логист автотранспорта',
                'rating' => 91,
                'man' => 93,
                'woman' => 89,
            ],[
                'name' => 'Руководитель автосервиса',
                'rating' => 95,
                'man' => 98,
                'woman' => 78,
            ],[
                'name' => 'Тюнер автомобилей',
                'rating' => 88,
                'man' => 98,
                'woman' => 77,
            ],[
                'name' => 'Эксперт по автомобилям',
                'rating' => 95,
                'man' => 95,
                'woman' => 87,
            ],[
                'name' => 'Специалист по автострахованию',
                'rating' => 89,
                'man' => 89,
                'woman' => 95,
            ],[
                'name' => 'Специалист по автострахованию',
                'rating' => 89,
                'man' => 89,
                'woman' => 95,
            ],[
                'name' => 'Психолог-консультант',
                'rating' => 98,
                'man' => 89,
                'woman' => 98,
            ],[
                'name' => 'Клинический психолог',
                'rating' => 98,
                'man' => 87,
                'woman' => 99,
            ],[
                'name' => 'Детский психолог',
                'rating' => 98,
                'man' => 84,
                'woman' => 100,
            ],[
                'name' => 'Психотерапевт',
                'rating' => 98,
                'man' => 89,
                'woman' => 98,
            ],[
                'name' => 'Коуч по личностному развитию',
                'rating' => 100,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Бизнес-коуч',
                'rating' => 98,
                'man' => 97,
                'woman' => 89,
            ],[
                'name' => 'Спортивный психолог',
                'rating' => 86,
                'man' => 93,
                'woman' => 91,
            ],[
                'name' => 'Семейный психолог',
                'rating' => 98,
                'man' => 86,
                'woman' => 99,
            ],[
                'name' => 'Психолог-исследователь',
                'rating' => 95,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Школьный психолог',
                'rating' => 94,
                'man' => 86,
                'woman' => 99,
            ],[
                'name' => 'Психолог-реабилитолог',
                'rating' => 96,
                'man' => 87,
                'woman' => 98,
            ],[
                'name' => 'Специалист по профориентации',
                'rating' => 100,
                'man' => 89,
                'woman' => 98,
            ],[
                'name' => 'Психолог для работы с подростками',
                'rating' => 98,
                'man' => 86,
                'woman' => 99,
            ],[
                'name' => 'Эксперт по психосоматике',
                'rating' => 97,
                'man' => 89,
                'woman' => 98,
            ],[
                'name' => 'Психолог-криминалист',
                'rating' => 95,
                'man' => 93,
                'woman' => 89,
            ],[
                'name' => 'Психолог-криминалист',
                'rating' => 95,
                'man' => 93,
                'woman' => 89,
            ],[
                'name' => 'Журналист',
                'rating' => 95,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Редактор',
                'rating' => 88,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Репортер',
                'rating' => 90,
                'man' => 93,
                'woman' => 91,
            ],[
                'name' => 'Корреспондент',
                'rating' => 95,
                'man' => 94,
                'woman' => 91,
            ],[
                'name' => 'Фото- и видеожурналист',
                'rating' => 90,
                'man' => 95,
                'woman' => 87,
            ],[
                'name' => 'Копирайтер',
                'rating' => 85,
                'man' => 87,
                'woman' => 97,
            ],[
                'name' => 'Главный редактор',
                'rating' => 90,
                'man' => 96,
                'woman' => 89,
            ],[
                'name' => 'Пресс-секретарь',
                'rating' => 90,
                'man' => 89,
                'woman' => 95,
            ],[
                'name' => 'Медиа-аналитик',
                'rating' => 90,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Медиапродюсер',
                'rating' => 90,
                'man' => 93,
                'woman' => 91,
            ],[
                'name' => 'Подкастер',
                'rating' => 91,
                'man' => 91,
                'woman' => 91,
            ],[
                'name' => 'Блогер',
                'rating' => 91,
                'man' => 89,
                'woman' => 95,
            ],[
                'name' => 'Медиаконсультант',
                'rating' => 90,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Культурный обозреватель',
                'rating' => 85,
                'man' => 89,
                'woman' => 95,
            ],[
                'name' => 'Пожарный',
                'rating' => 80,
                'man' => 100,
                'woman' => 75,
            ],[
                'name' => 'Полицейский',
                'rating' => 85,
                'man' => 100,
                'woman' => 76,
            ],[
                'name' => 'Спасатель (МЧС)',
                'rating' => 85,
                'man' => 100,
                'woman' => 76,
            ],[
                'name' => 'Сотрудник спецслужб (КНБ, ФСБ и др.)',
                'rating' => 93,
                'man' => 100,
                'woman' => 76,
            ],[
                'name' => 'Инспектор ГИБДД (ДПС)',
                'rating' => 81,
                'man' => 100,
                'woman' => 75,
            ],[
                'name' => 'Таможенник',
                'rating' => 82,
                'man' => 98,
                'woman' => 83,
            ],[
                'name' => 'Военнослужащий',
                'rating' => 86,
                'man' => 100,
                'woman' => 75,
            ],[
                'name' => 'Пограничник',
                'rating' => 81,
                'man' => 100,
                'woman' => 75,
            ],[
                'name' => 'Государственный инспектор',
                'rating' => 82,
                'man' => 95,
                'woman' => 87,
            ],[
                'name' => 'Пресс-секретарь государственного органа',
                'rating' => 88,
                'man' => 89,
                'woman' => 95,
            ],[
                'name' => 'Менеджер социальных проектов (в гос. секторе)',
                'rating' => 87,
                'man' => 89,
                'woman' => 95,
            ],[
                'name' => 'Спичрайтер для госслужащих',
                'rating' => 89,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Специалист по документообороту в госаппарате',
                'rating' => 90,
                'man' => 87,
                'woman' => 97,
            ],[
                'name' => 'Специалист по государственным закупкам',
                'rating' => 91,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Офицер по связям с общественностью',
                'rating' => 85,
                'man' => 91,
                'woman' => 91,
            ],[
                'name' => 'Графический дизайн',
                'rating' => 100,
                'man' => 89,
                'woman' => 100,
            ],[
                'name' => 'Веб-дизайн',
                'rating' => 100,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Дизайн интерьера',
                'rating' => 100,
                'man' => 87,
                'woman' => 98,
            ],[
                'name' => 'Ландшафтный дизайн',
                'rating' => 97,
                'man' => 89,
                'woman' => 96,
            ],[
                'name' => 'Модный дизайн',
                'rating' => 90,
                'man' => 84,
                'woman' => 100,
            ],[
                'name' => 'Промышленный дизайн',
                'rating' => 91,
                'man' => 95,
                'woman' => 87,
            ],[
                'name' => 'Анимационный дизайн',
                'rating' => 96,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Дизайн игр',
                'rating' => 98,
                'man' => 95,
                'woman' => 87,
            ],[
                'name' => 'Дизайн упаковки',
                'rating' => 88,
                'man' => 89,
                'woman' => 95,
            ],[
                'name' => 'Брендинг и айдентика',
                'rating' => 90,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Автомобильный дизайн',
                'rating' => 95,
                'man' => 98,
                'woman' => 83,
            ],[
                'name' => 'Иллюстрация и концепт-арт',
                'rating' => 92,
                'man' => 91,
                'woman' => 93,
            ],[
                'name' => 'Типографика и дизайн шрифтов',
                'rating' => 80,
                'man' => 89,
                'woman' => 95,
            ],[
                'name' => 'Дизайн мебели',
                'rating' => 95,
                'man' => 93,
                'woman' => 89,
            ],[
                'name' => 'Арт-дирекция',
                'rating' => 92,
                'man' => 93,
                'woman' => 89,
            ],
        ];

        DB::transaction(function () use ($rawData) {
            foreach ($rawData as $item) {
                DB::table('professions')
                    ->where('name', $item['name'])
                    ->update([
                        'rating' => $item['rating'],
                        'man' => $item['man'],
                        'woman' => $item['woman'],
                    ]);
            }
        });
    }
}
