<?php

return [
    'test_preparation' => [
        'about' => [
            'what_you_get' => 'Что вы получите',
            'talents' => [
                'title' => '24 талантов',
                'desc' => 'разбор ваших сильных сторон по методике ProfGid'
            ],
            'sphere' => [
                'title' => '10 сфер',
                'desc' => 'подходящие направления деятельности'
            ],
            'profession' => [
                'title' => '10+ профессии',
                'desc' => 'конкретные профессии, которые максимально соответствуют вашему профилю'
            ],
        ],
    ]
];
